/** @jsx jsx */
import { jsx, css } from '@emotion/core'
import { Fragment } from 'react'

const Color = css`
  width: inherit;
  height: auto;
  path {
    fill: #434343;
  }
`

export default function ItemshopIco() {

  return (
    <Fragment>
      <svg xmlns="http://www.w3.org/2000/svg" width="80" height="70.313" viewBox="0 0 80 70.313" css={Color}>
        <g id="shopping-cart" transform="translate(0 0)">
          <path
            id="패스_3643"
            data-name="패스 3643"
            d="M25.775,46.876H68.281a2.344,2.344,0,0,0,2.253-1.7L79.91,12.363a2.344,2.344,0,0,0-2.253-2.988H20.37l-1.675-7.54A2.344,2.344,0,0,0,16.406,0H2.344a2.344,2.344,0,0,0,0,4.688H14.526c.3,1.336,8.018,36.081,8.462,38.08A7.03,7.03,0,0,0,25.781,56.25h42.5a2.344,2.344,0,0,0,0-4.688h-42.5a2.343,2.343,0,0,1-.006-4.687ZM74.549,14.063,66.513,42.188H27.661l-6.25-28.125Zm0,0"
            fill="#434343"
          />
          <path
            id="패스_3644"
            data-name="패스 3644"
            d="M150,367.031A7.031,7.031,0,1,0,157.031,360,7.039,7.039,0,0,0,150,367.031Zm7.031-2.344a2.344,2.344,0,1,1-2.344,2.344A2.347,2.347,0,0,1,157.031,364.688Zm0,0"
            transform="translate(-126.563 -303.75)"
            fill="#434343"
          />
          <path
            id="패스_3645"
            data-name="패스 3645"
            d="M362,367.031A7.031,7.031,0,1,0,369.031,360,7.039,7.039,0,0,0,362,367.031Zm7.031-2.344a2.344,2.344,0,1,1-2.344,2.344A2.347,2.347,0,0,1,369.031,364.688Zm0,0"
            transform="translate(-305.438 -303.75)"
            fill="#434343"
          />
        </g>
      </svg>
    </Fragment>
  )
}
